package com.sheva.domain;

public interface BooksInfo {

    String[] booksNames = new String[]{ "Мастер и Маргарита", "Преступление и наказание", "Вишневый сад", "Анна Каренина",
    "Мёртвые души", "Отцы и дети", "Евгений Онегин", "На дне", "Горе от ума", "Герой нашего времени", "Тихий Дон", "Два капитана",
    "Волшебник Изумрудного города", "Семнадцать мгновений весны", "Алые паруса", "Обломов", "Доктор Живаго", "Незнайка на Луне",
    "Гранатовый браслет"};

    String[] authorsSurnames = new String[]{"Булгаков", "Достоевский", "Чехов", "Толстой", "Гоголь", "Тургенев", "Пушкин",
    "Горький", "Грибоедов", "Лермонтов", "Шолохов", "Каверин", "Волков", "Семенов", "Гриневский", "Гончаров", "Пастернак",
    "Носов", "Куприн"};

    String[] authorsNames = new String[]{"Михаил", "Федор", "Антон", "Лев", "Николай", "Иван", "Александр", "Максим",
    "Александр", "Максим", "Михаил", "Вениамин", "Александр", "Юлиан", "Александр", "Иван", "Борис", "Николай", "Александр"};

    String[] authorsPatronymic = new String[]{"Афанасьевич", "Михайлович", "Павлович", "Николаевич", "Васильевич", "Сергеевич",
     "Сергеевич", "Максимович", "Сергеевич", "Юрьевич", "Александрович", "Александрович", "Меленьтьевич", "Семенович", "Стапанович",
    "Александрович", "Леонидович", "Николаевич", "Иванович"};

    int[] pagesNumbers = new int[]{480, 608, 416, 864, 352, 416, 448, 416, 256, 224, 1440, 720, 226, 986, 104, 576, 608,
    576, 352};

    int[] yearsPublishing = new int[]{1940, 1866, 1903, 1877, 1842, 1861, 1837, 1902, 1828, 1840,1940, 1944, 1939, 1969,
    1922, 1858, 1955, 1965, 1910};
}
